// Java: знакомство и как пользоваться базовым API (лекции)
// API что такое? - это возможности предоставляемые разработчиками языка.

public class lec2 {
    public static void main(String[] args) {
        // StringBuilder sb = new StringBuilder(); // Если компануем, собираем материал то стрингбилдер.
        // Разбираете готовый материал,используем стринг.
        // for (int i = 0; i < 1_000_000; i++) {
        //     sb.append("+");
        //     System.out.println(sb);
    // }
            //Весь курс построен на том,что мы самостоятельно смотрим документацию.
            // Работа с Файлами(смотреть презентацию 1)  
        //  Работа с поиском ошибок: 
        // try - код в котором может появиться ошибка 
        // catch(Exeption e) - обработка если ошибка случилась 
        // finally - код который выполнится в любом случае.
        // приоритетней импортировать библиотеки выборочно, а не полностью.
         
    }
}
